example/todo_list/app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
---
SELECT * FROM "todos"

  def show
    @todo = Todo.find(params[:id])
---
SELECT * FROM "todos" WHERE ("todos"."id" = 1)

  def create
    @todo = Todo.new(params[:todo])

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("created_at", "title", "updated_at", "description") VALUES('2009-07-20 15:27:50', 'move flash to controller', '2009-07-20 15:27:50', '')

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT * FROM "todos" WHERE ("todos"."id" = 4)
DELETE FROM "todos" WHERE "id" = 4